import datetime
while True:
 amka = str(input("ΔΩΣΕ ΑΜΚΑ:")) #ζητάει από τον χρήστη να πληκτρολογίσει το ΑΜΚΑ του
 if (len(amka) == 11) : #γίνεται έλεγχος ότι το μήκος είναι 11 ψηφία
    if int(amka[4:6]) > 22 : #συγκρίνει το 5ο και το 6ο ψηφίο του ΑΜΚΑ με τα δύο τελευταία ψηφία της τωρινής χρονολογίας ώστε να γίνει η ανάλογη προσαρμογή για τον σωστό υπολογισμό της ηλικίας
        date = int('19' + amka[4:6]) #προσαρμογή σε πλήρη χρονολογία γέννησης
        nowDate = datetime.datetime.now().year #generate τωρινής χρονολογίας
        print ("Ο/Η κάτοχος είναι ",int(nowDate)-date," ετών")
    else:
        date = int('20' + amka[4:6]) 
        nowDate = datetime.datetime.now().year 
        print ("Ο/Η κάτοχος είναι ",int(nowDate)-date," ετών")
    second_part = int(amka[6:10]) #καθορίζω τα επόμενα 4 ψηφία
    if second_part % 2 == 0 : #ελέγχω το mod των 4 επόμενων ψηφίων και εάν είναι 0 σημαίνει πώς ο αριθμός είναι άρτιος
        print ("γυναίκα")
    else:
        print ("άνδρας")
 else:
   print(" παρακαλω δωστε 11 ψηφια") #μήνυμα σφάλματος εάν προκύψει πώς το ΑΜΚΑ δεν αποτελείται από 11 ψηφία
   amka = str(input("ΔΩΣΕ ΑΜΚΑ:"))
 redo = input("Θέλετε να ελένξετε άλλο ΑΜΚΑ? (Ν)αι/(Ο)χι: ").upper()
 if redo != "Ν" or redo == "" or redo == " ": #παράμετρος όπου το loop τερματίζει
    print ("ΤΕΛΟΣ ΠΡΟΓΡΑΜΜΑΤΟΣ")
    break
